package third_theme;

public class ThirdTaskT3 {

    // Необходимо написать программу, которая бы вывела в консоль
    //звездочки вот таким образом:
    //* * * * *
    //* * * * *
    //* * * * *

    public void printStars(){
        for(int i = 0; i < 3; i++){
            System.out.println("* ".repeat(5));
        }
    }

}
